---
kind: type
id: T:Autodesk.Revit.DB.Events.ViewsExportingByContextEventArgs
source: html/5db665aa-f9cb-f204-72e0-eff6597a9a9d.htm
---
# Autodesk.Revit.DB.Events.ViewsExportingByContextEventArgs

The event arguments used by the ViewsExportingByContext event.

## Syntax (C#)
```csharp
public class ViewsExportingByContextEventArgs : RevitAPIPreDocEventArgs
```